pipe/pipe/contraction/system/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 -0.5)     //0
    (400 0 -0.5)     //1
    (0 2.54 -0.5)     //2
    (400 2.54 -0.5)     //3
    (800 2.54 -0.5)     //4
    (0 7.15 -0.5)     //5
    (400 7.15 -0.5)     //6
    (800 7.15 -0.5)     //7
    (0 11.76 -0.5)     //8
    (400 11.76 -0.5)     //9
    (800 11.76 -0.5)     //10
    (0 14.3 -0.5)     //11
    (400 14.3 -0.5)     //12

    (00 0 0.5)     //13
    (400 0 0.5)     //14
    (0 2.54 0.5)     //15
    (400 2.54 0.5)     //16
    (800 2.54 0.5)     //17
    (0 7.15 0.5)     //18
    (400 7.15 0.5)     //19
    (800 7.15 0.5)     //20
    (0 11.76 0.5)     //21
    (400 11.76 0.5)     //22
    (800 11.76 0.5)     //23
    (0 14.3 0.5)     //24
    (400 14.3 0.5)     //25
);

blocks
(
    hex (0 1 3 2 13 14 16 15) (400 117 1) //0
    simpleGrading
    (1 1 1)

    hex (2 3 6 5 15 16 19 18) (400 30 1) //1
    simpleGrading
    (1 22.2 1)

    hex (5 6 9 8 18 19 22 21) (400 30 1) //2
    simpleGrading
    (1 0.045 1)

    hex (8 9 12 11 21 22 25 24) (400 117 1) //3
    simpleGrading
    (1 1 1)

    hex (3 4 7 6 16 17 20 19) (400 30 1) //4
    simpleGrading
    (1 22.2 1)

    hex (6 7 10 9 19 20 23 22) (400 30 1) //5
    simpleGrading
    (1 0.045 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 13 15 2)
            (2 15 18 5)
            (5 18 21 8)
            (8 21 24 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (17 4 7 20)
            (20 7 10 23)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (11 24 25 12)
            (9 12 25 22)
            (9 22 23 10)
            (3 4 17 16)
            (1 3 16 14)
            (0 1 14 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (15 13 14 16)
            (18 15 16 19)
            (21 18 19 22)
            (24 21 22 25)
            (16 17 20 19)
            (19 20  23 22)
            (0 1 3 2)
            (2 3 6 5)
            (5 6 9 8)
            (8 9 12 11)
            (3 4 7 6)
            (6 7 10 9)
        );
    }   
);

// ************************************************************************* //
